[Killed] BlockStatement
src/services/payment/PaymentResult.js:2:33
 class PaymentResult {
-  static fromResponse(response) {
-    if (response && response.status === 'APROVADO') {
-      return new ApprovedPaymentResult(response);
-    }
-    return new DeclinedPaymentResult(response);
-  }
+  static fromResponse(response) {}
 
   static fromError(error) {
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: TypeError: Cannot read properties of undefined (reading 'applyTo')

[Killed] ConditionalExpression
src/services/payment/PaymentResult.js:3:21
 class PaymentResult {
   static fromResponse(response) {
-    if (response && response.status === 'APROVADO') {
+    if (response && true) {
       return new ApprovedPaymentResult(response);
     }
killedBy: CheckoutService BDD Specifications Tratamento de Pagamento Recusado (Falha de Negócio)
statusReason: Error: expect(received).toBeNull()

Received: {"cartao": {"cvv": "123", "numero": "1234-5678-9012-3456", "validade": "12/28"}, "clienteEmail": "cliente@entregasja.com.br", "id": 4075, "status": "PROCESSADO", "valor": 80}

[Killed] LogicalOperator
src/services/payment/PaymentResult.js:3:9
 class PaymentResult {
   static fromResponse(response) {
-    if (response && response.status === 'APROVADO') {
+    if (response || response.status === 'APROVADO') {
       return new ApprovedPaymentResult(response);
     }
killedBy: CheckoutService BDD Specifications Tratamento de Pagamento Recusado (Falha de Negócio)
statusReason: Error: expect(received).toBeNull()

Received: {"cartao": {"cvv": "123", "numero": "1234-5678-9012-3456", "validade": "12/28"}, "clienteEmail": "cliente@entregasja.com.br", "id": 5140, "status": "PROCESSADO", "valor": 80}

[Killed] BlockStatement
src/services/payment/PaymentResult.js:9:27
     return new DeclinedPaymentResult(response);
   }
 
-  static fromError(error) {
-    return new ErrorPaymentResult(error);
-  }
+  static fromError(error) {}
 
   constructor(data) {
killedBy: CheckoutService BDD Specifications Falha de Infraestrutura Persistente com Retentativas Esgotadas (Fallback)
statusReason: TypeError: Cannot read properties of undefined (reading 'applyTo')

[Survived] BlockStatement
src/services/payment/PaymentResult.js:13:21
     return new ErrorPaymentResult(error);
   }
 
-  constructor(data) {
-    this.data = data;
-  }
+  constructor(data) {}
 
   async applyTo(pedido, pedidoRepository, emailService) {

[NoCoverage] BlockStatement
src/services/payment/PaymentResult.js:17:57
     this.data = data;
   }
 
-  async applyTo(pedido, pedidoRepository, emailService) {
-    throw new Error("Method applyTo must be implemented");
-  }
+  async applyTo(pedido, pedidoRepository, emailService) {}
 }
 

[Killed] BlockStatement
src/services/payment/PaymentResult.js:23:57
 }
 
 class ApprovedPaymentResult extends PaymentResult {
-  async applyTo(pedido, pedidoRepository, emailService) {
-    pedido.status = 'PROCESSADO';
-    const pedidoSalvo = await pedidoRepository.salvar(pedido);
-    
-    // Non-blocking asynchronous email dispatch
-    emailService.enviarConfirmacao(pedido.clienteEmail, "Pagamento Aprovado")
-      .catch(err => console.error("Erro assincrono de e-mail:", err.message));
-      
-    return pedidoSalvo;
-  }
+  async applyTo(pedido, pedidoRepository, emailService) {}
 }
 
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Survived] ArrowFunction
src/services/payment/PaymentResult.js:29:14
     
     // Non-blocking asynchronous email dispatch
     emailService.enviarConfirmacao(pedido.clienteEmail, "Pagamento Aprovado")
-      .catch(err => console.error("Erro assincrono de e-mail:", err.message));
+      .catch(() => undefined);
       
     return pedidoSalvo;

[Killed] BlockStatement
src/services/payment/PaymentResult.js:36:57
 }
 
 class DeclinedPaymentResult extends PaymentResult {
-  async applyTo(pedido, pedidoRepository, emailService) {
-    pedido.status = 'FALHOU';
-    await pedidoRepository.salvar(pedido);
-    return null;
-  }
+  async applyTo(pedido, pedidoRepository, emailService) {}
 }
 
killedBy: CheckoutService BDD Specifications Tratamento de Pagamento Recusado (Falha de Negócio)
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/services/payment/PaymentResult.js:44:57
 }
 
 class ErrorPaymentResult extends PaymentResult {
-  async applyTo(pedido, pedidoRepository, emailService) {
-    pedido.status = 'ERRO_GATEWAY';
-    await pedidoRepository.salvar(pedido);
-    return null;
-  }
+  async applyTo(pedido, pedidoRepository, emailService) {}
 }
 
killedBy: CheckoutService BDD Specifications Falha de Infraestrutura Persistente com Retentativas Esgotadas (Fallback)
statusReason: Error: expect(received).toBeNull()

Received: undefined
