[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:2:29
 class CircuitBreaker {
-  constructor(options = {}) {
-    this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
-    this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
-    this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
-    this.cooldownMs = options.cooldownMs !== undefined ? options.cooldownMs : 10000;
-    
-    this.state = 'CLOSED';
-    this.history = []; // true for success, false for failure
-    this.nextAllowedTime = 0;
-  }
+  constructor(options = {}) {}
 
   isOpen() {
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:3:23
 class CircuitBreaker {
   constructor(options = {}) {
-    this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
+    this.windowSize = false ? options.windowSize : 10;
     this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
     this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker limita o historico ao tamanho da janela configurada
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [true, true, true]

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:3:23
 class CircuitBreaker {
   constructor(options = {}) {
-    this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
+    this.windowSize = options.windowSize === undefined ? options.windowSize : 10;
     this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
     this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker limita o historico ao tamanho da janela configurada
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [true, true, true]

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:4:24
 class CircuitBreaker {
   constructor(options = {}) {
     this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
-    this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
+    this.minRequests = options.minRequests === undefined ? options.minRequests : 5;
     this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
     this.cooldownMs = options.cooldownMs !== undefined ? options.cooldownMs : 10000;
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:4:24
 class CircuitBreaker {
   constructor(options = {}) {
     this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
-    this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
+    this.minRequests = true ? options.minRequests : 5;
     this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
     this.cooldownMs = options.cooldownMs !== undefined ? options.cooldownMs : 10000;
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:5:29
   constructor(options = {}) {
     this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
     this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
-    this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
+    this.failureThreshold = true ? options.failureThreshold : 0.5; // >= 50%
     this.cooldownMs = options.cooldownMs !== undefined ? options.cooldownMs : 10000;
     
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:5:29
   constructor(options = {}) {
     this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
     this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
-    this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
+    this.failureThreshold = options.failureThreshold === undefined ? options.failureThreshold : 0.5; // >= 50%
     this.cooldownMs = options.cooldownMs !== undefined ? options.cooldownMs : 10000;
     
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:6:23
     this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
     this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
     this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
-    this.cooldownMs = options.cooldownMs !== undefined ? options.cooldownMs : 10000;
+    this.cooldownMs = options.cooldownMs === undefined ? options.cooldownMs : 10000;
     
     this.state = 'CLOSED';
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:6:23
     this.windowSize = options.windowSize !== undefined ? options.windowSize : 10;
     this.minRequests = options.minRequests !== undefined ? options.minRequests : 5;
     this.failureThreshold = options.failureThreshold !== undefined ? options.failureThreshold : 0.5; // >= 50%
-    this.cooldownMs = options.cooldownMs !== undefined ? options.cooldownMs : 10000;
+    this.cooldownMs = false ? options.cooldownMs : 10000;
     
     this.state = 'CLOSED';
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:13:12
     this.nextAllowedTime = 0;
   }
 
-  isOpen() {
-    this.checkCooldown();
-    return this.state === 'OPEN';
-  }
+  isOpen() {}
 
   checkCooldown() {
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:15:12
 
   isOpen() {
     this.checkCooldown();
-    return this.state === 'OPEN';
+    return this.state !== 'OPEN';
   }
 
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:15:12
 
   isOpen() {
     this.checkCooldown();
-    return this.state === 'OPEN';
+    return false;
   }
 
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:18:19
     return this.state === 'OPEN';
   }
 
-  checkCooldown() {
-    if (this.state === 'OPEN' && Date.now() >= this.nextAllowedTime) {
-      this.state = 'HALF_OPEN';
-    }
-  }
+  checkCooldown() {}
 
   async execute(action) {
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:19:70
   }
 
   checkCooldown() {
-    if (this.state === 'OPEN' && Date.now() >= this.nextAllowedTime) {
-      this.state = 'HALF_OPEN';
-    }
+    if (this.state === 'OPEN' && Date.now() >= this.nextAllowedTime) {}
   }
 
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:19:9
   }
 
   checkCooldown() {
-    if (this.state === 'OPEN' && Date.now() >= this.nextAllowedTime) {
+    if (true && Date.now() >= this.nextAllowedTime) {
       this.state = 'HALF_OPEN';
     }
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "erro 2"
Received message:   "Circuit breaker is open"

       95 |         } else {
       96 |           stryCov_9fa48("65");
    >  97 |           throw new Error(stryMutAct_9fa48("66") ? "" : (stryCov_9fa48("66"), "Circuit breaker is open"));

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:24:25
     }
   }
 
-  async execute(action) {
-    if (this.isOpen()) {
-      throw new Error("Circuit breaker is open");
-    }
-
-    try {
-      const result = await action();
-      this.recordSuccess();
-      return result;
-    } catch (error) {
-      this.recordFailure();
-      throw error;
-    }
-  }
+  async execute(action) {}
 
   recordSuccess() {
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:25:9
   }
 
   async execute(action) {
-    if (this.isOpen()) {
+    if (false) {
       throw new Error("Circuit breaker is open");
     }
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: "nao deveria executar"

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:25:9
   }
 
   async execute(action) {
-    if (this.isOpen()) {
+    if (true) {
       throw new Error("Circuit breaker is open");
     }
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "erro 1"
Received message:   "Circuit breaker is open"

       95 |         } else {
       96 |           stryCov_9fa48("65");
    >  97 |           throw new Error(stryMutAct_9fa48("66") ? "" : (stryCov_9fa48("66"), "Circuit breaker is open"));

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:29:9
       throw new Error("Circuit breaker is open");
     }
 
-    try {
-      const result = await action();
-      this.recordSuccess();
-      return result;
-    } catch (error) {
+    try {} catch (error) {
       this.recordFailure();
       throw error;
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:33:21
       const result = await action();
       this.recordSuccess();
       return result;
-    } catch (error) {
-      this.recordFailure();
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:39:19
     }
   }
 
-  recordSuccess() {
-    if (this.state === 'HALF_OPEN') {
-      this.state = 'CLOSED';
-      this.history = [];
-    }
-    this.pushHistory(true);
-  }
+  recordSuccess() {}
 
   recordFailure() {
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "HALF_OPEN"

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:40:9
   }
 
   recordSuccess() {
-    if (this.state === 'HALF_OPEN') {
+    if (true) {
       this.state = 'CLOSED';
       this.history = [];
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker limita o historico ao tamanho da janela configurada
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [true]

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:40:9
   }
 
   recordSuccess() {
-    if (this.state === 'HALF_OPEN') {
+    if (false) {
       this.state = 'CLOSED';
       this.history = [];
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CLOSED"
Received: "HALF_OPEN"

[Killed] BooleanLiteral
src/services/resilience/CircuitBreaker.js:44:22
       this.state = 'CLOSED';
       this.history = [];
     }
-    this.pushHistory(true);
+    this.pushHistory(false);
   }
 
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker limita o historico ao tamanho da janela configurada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   true,
-   true,

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:47:19
     this.pushHistory(true);
   }
 
-  recordFailure() {
-    this.pushHistory(false);
-    this.evaluateState();
-  }
+  recordFailure() {}
 
   pushHistory(success) {
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] BooleanLiteral
src/services/resilience/CircuitBreaker.js:48:22
   }
 
   recordFailure() {
-    this.pushHistory(false);
+    this.pushHistory(true);
     this.evaluateState();
   }
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:52:24
     this.evaluateState();
   }
 
-  pushHistory(success) {
-    this.history.push(success);
-    if (this.history.length > this.windowSize) {
-      this.history.shift();
-    }
-  }
+  pushHistory(success) {}
 
   evaluateState() {
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:54:48
 
   pushHistory(success) {
     this.history.push(success);
-    if (this.history.length > this.windowSize) {
-      this.history.shift();
-    }
+    if (this.history.length > this.windowSize) {}
   }
 
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker limita o historico ao tamanho da janela configurada
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [true, true, true]

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:54:9
 
   pushHistory(success) {
     this.history.push(success);
-    if (this.history.length > this.windowSize) {
+    if (true) {
       this.history.shift();
     }
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:59:19
     }
   }
 
-  evaluateState() {
-    if (this.state === 'HALF_OPEN') {
-      this.state = 'OPEN';
-      this.nextAllowedTime = Date.now() + this.cooldownMs;
-      return;
-    }
-
-    if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
-      const failures = this.history.filter(s => !s).length;
-      const rate = failures / this.history.length;
-      if (rate >= this.failureThreshold) {
-        this.state = 'OPEN';
-        this.nextAllowedTime = Date.now() + this.cooldownMs;
-      }
-    }
-  }
+  evaluateState() {}
 }
 
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:60:9
   }
 
   evaluateState() {
-    if (this.state === 'HALF_OPEN') {
+    if (this.state !== 'HALF_OPEN') {
       this.state = 'OPEN';
       this.nextAllowedTime = Date.now() + this.cooldownMs;
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "erro 2"
Received message:   "Circuit breaker is open"

       95 |         } else {
       96 |           stryCov_9fa48("65");
    >  97 |           throw new Error(stryMutAct_9fa48("66") ? "" : (stryCov_9fa48("66"), "Circuit breaker is open"));

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:60:9
   }
 
   evaluateState() {
-    if (this.state === 'HALF_OPEN') {
+    if (true) {
       this.state = 'OPEN';
       this.nextAllowedTime = Date.now() + this.cooldownMs;
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "erro 2"
Received message:   "Circuit breaker is open"

       95 |         } else {
       96 |           stryCov_9fa48("65");
    >  97 |           throw new Error(stryMutAct_9fa48("66") ? "" : (stryCov_9fa48("66"), "Circuit breaker is open"));

[NoCoverage] ArithmeticOperator
src/services/resilience/CircuitBreaker.js:62:30
   evaluateState() {
     if (this.state === 'HALF_OPEN') {
       this.state = 'OPEN';
-      this.nextAllowedTime = Date.now() + this.cooldownMs;
+      this.nextAllowedTime = Date.now() - this.cooldownMs;
       return;
     }

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:66:9
       return;
     }
 
-    if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
+    if (this.state !== 'CLOSED' && this.history.length >= this.minRequests) {
       const failures = this.history.filter(s => !s).length;
       const rate = failures / this.history.length;
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] EqualityOperator
src/services/resilience/CircuitBreaker.js:66:36
       return;
     }
 
-    if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
+    if (this.state === 'CLOSED' && this.history.length < this.minRequests) {
       const failures = this.history.filter(s => !s).length;
       const rate = failures / this.history.length;
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "erro 2"
Received message:   "Circuit breaker is open"

       95 |         } else {
       96 |           stryCov_9fa48("65");
    >  97 |           throw new Error(stryMutAct_9fa48("66") ? "" : (stryCov_9fa48("66"), "Circuit breaker is open"));

[Killed] BooleanLiteral
src/services/resilience/CircuitBreaker.js:67:49
     }
 
     if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
-      const failures = this.history.filter(s => !s).length;
+      const failures = this.history.filter(s => s).length;
       const rate = failures / this.history.length;
       if (rate >= this.failureThreshold) {
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/services/resilience/CircuitBreaker.js:67:44
     }
 
     if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
-      const failures = this.history.filter(s => !s).length;
+      const failures = this.history.filter(() => undefined).length;
       const rate = failures / this.history.length;
       if (rate >= this.failureThreshold) {
killedBy: Fase 3 - Mutation Testing Focused Specs CircuitBreaker abre, bloqueia chamadas e volta a fechar após cooldown e sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArithmeticOperator
src/services/resilience/CircuitBreaker.js:68:20
 
     if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
       const failures = this.history.filter(s => !s).length;
-      const rate = failures / this.history.length;
+      const rate = failures * this.history.length;
       if (rate >= this.failureThreshold) {
         this.state = 'OPEN';

[Killed] BlockStatement
src/services/resilience/CircuitBreaker.js:69:42
     if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
       const failures = this.history.filter(s => !s).length;
       const rate = failures / this.history.length;
-      if (rate >= this.failureThreshold) {
-        this.state = 'OPEN';
-        this.nextAllowedTime = Date.now() + this.cooldownMs;
-      }
+      if (rate >= this.failureThreshold) {}
     }
   }
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:69:11
     if (this.state === 'CLOSED' && this.history.length >= this.minRequests) {
       const failures = this.history.filter(s => !s).length;
       const rate = failures / this.history.length;
-      if (rate >= this.failureThreshold) {
+      if (false) {
         this.state = 'OPEN';
         this.nextAllowedTime = Date.now() + this.cooldownMs;
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4
