[Killed] BlockStatement
src/services/CheckoutService.js:7:79
 const { RetryPolicy } = require('./resilience/RetryPolicy');
 
 class CheckoutService {
-  constructor(gatewayPagamento, pedidoRepository, emailService, options = {}) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.pedidoRepository = pedidoRepository;
-    this.emailService = emailService;
-    
-    this.circuitBreaker = new CircuitBreaker(options.circuitBreaker);
-    this.retryPolicy = new RetryPolicy(options.retryPolicy);
-  }
+  constructor(gatewayPagamento, pedidoRepository, emailService, options = {}) {}
 
   async processar(pedido) {
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: TypeError: Cannot read properties of undefined (reading 'salvar')

[Killed] BlockStatement
src/services/CheckoutService.js:16:27
     this.retryPolicy = new RetryPolicy(options.retryPolicy);
   }
 
-  async processar(pedido) {
-    // 1. RF01: Validação de Entrada de Dados (Sanitização)
-    CheckoutValidator.validar(pedido);
-
-    let paymentResult;
-    try {
-      // 2. Executa a cobrança no gateway bancário sob Circuit Breaker + Retry Policy
-      const resposta = await this.circuitBreaker.execute(async () => {
-        return await this.retryPolicy.execute(async () => {
-          return await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-        });
-      });
-      
-      // 3. Mapeia a resposta para um resultado polimórfico
-      paymentResult = PaymentResult.fromResponse(resposta);
-    } catch (error) {
-      console.error("Falha no processamento do gateway bancário:", error.message);
-      // 4. Mapeia o erro para o fallback do resultado polimórfico de erro
-      paymentResult = PaymentResult.fromError(error);
-    }
-
-    // 5. Executa a ação do resultado polimorficamente (salvar status, disparar email)
-    return await paymentResult.applyTo(pedido, this.pedidoRepository, this.emailService);
-  }
+  async processar(pedido) {}
 }
 
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:21:9
     CheckoutValidator.validar(pedido);
 
     let paymentResult;
-    try {
-      // 2. Executa a cobrança no gateway bancário sob Circuit Breaker + Retry Policy
-      const resposta = await this.circuitBreaker.execute(async () => {
-        return await this.retryPolicy.execute(async () => {
-          return await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-        });
-      });
-      
-      // 3. Mapeia a resposta para um resultado polimórfico
-      paymentResult = PaymentResult.fromResponse(resposta);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Falha no processamento do gateway bancário:", error.message);
       // 4. Mapeia o erro para o fallback do resultado polimórfico de erro
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: TypeError: Cannot read properties of undefined (reading 'applyTo')

[Killed] BlockStatement
src/services/CheckoutService.js:23:70
     let paymentResult;
     try {
       // 2. Executa a cobrança no gateway bancário sob Circuit Breaker + Retry Policy
-      const resposta = await this.circuitBreaker.execute(async () => {
-        return await this.retryPolicy.execute(async () => {
-          return await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-        });
-      });
+      const resposta = await this.circuitBreaker.execute(async () => {});
       
       // 3. Mapeia a resposta para um resultado polimórfico
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/services/CheckoutService.js:24:59
     try {
       // 2. Executa a cobrança no gateway bancário sob Circuit Breaker + Retry Policy
       const resposta = await this.circuitBreaker.execute(async () => {
-        return await this.retryPolicy.execute(async () => {
-          return await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-        });
+        return await this.retryPolicy.execute(async () => {});
       });
       
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/services/CheckoutService.js:31:21
       
       // 3. Mapeia a resposta para um resultado polimórfico
       paymentResult = PaymentResult.fromResponse(resposta);
-    } catch (error) {
-      console.error("Falha no processamento do gateway bancário:", error.message);
-      // 4. Mapeia o erro para o fallback do resultado polimórfico de erro
-      paymentResult = PaymentResult.fromError(error);
-    }
+    } catch (error) {}
 
     // 5. Executa a ação do resultado polimorficamente (salvar status, disparar email)
killedBy: CheckoutService BDD Specifications Falha de Infraestrutura Persistente com Retentativas Esgotadas (Fallback)
statusReason: TypeError: Cannot read properties of undefined (reading 'applyTo')

[Killed] StringLiteral
src/services/CheckoutService.js:32:21
       // 3. Mapeia a resposta para um resultado polimórfico
       paymentResult = PaymentResult.fromResponse(resposta);
     } catch (error) {
-      console.error("Falha no processamento do gateway bancário:", error.message);
+      console.error("", error.message);
       // 4. Mapeia o erro para o fallback do resultado polimórfico de erro
       paymentResult = PaymentResult.fromError(error);
killedBy: Fase 3 - Mutation Testing Focused Specs CheckoutService registra a mensagem de erro completa quando o gateway falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha no processamento do gateway bancário:", "Erro de infraestrutura do gateway"
Received: "", "Erro de infraestrutura do gateway"

Number of calls: 1
