[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:2:29
 class RetryPolicy {
-  constructor(options = {}) {
-    this.maxAttempts = options.maxAttempts !== undefined ? options.maxAttempts : 4; // 1 initial + 3 retries
-    this.backoffMs = options.backoffMs !== undefined ? options.backoffMs : 500;
-    this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
-  }
+  constructor(options = {}) {}
 
   async execute(action) {
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy reexecuta até obter sucesso antes do limite máximo
statusReason: Error: thrown: undefined

[Killed] ConditionalExpression
src/services/resilience/RetryPolicy.js:3:24
 class RetryPolicy {
   constructor(options = {}) {
-    this.maxAttempts = options.maxAttempts !== undefined ? options.maxAttempts : 4; // 1 initial + 3 retries
+    this.maxAttempts = false ? options.maxAttempts : 4; // 1 initial + 3 retries
     this.backoffMs = options.backoffMs !== undefined ? options.backoffMs : 500;
     this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy repassa o ultimo erro apos esgotar todas as tentativas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ConditionalExpression
src/services/resilience/RetryPolicy.js:3:24
 class RetryPolicy {
   constructor(options = {}) {
-    this.maxAttempts = options.maxAttempts !== undefined ? options.maxAttempts : 4; // 1 initial + 3 retries
+    this.maxAttempts = true ? options.maxAttempts : 4; // 1 initial + 3 retries
     this.backoffMs = options.backoffMs !== undefined ? options.backoffMs : 500;
     this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Timeout] ConditionalExpression
src/services/resilience/RetryPolicy.js:4:22
 class RetryPolicy {
   constructor(options = {}) {
     this.maxAttempts = options.maxAttempts !== undefined ? options.maxAttempts : 4; // 1 initial + 3 retries
-    this.backoffMs = options.backoffMs !== undefined ? options.backoffMs : 500;
+    this.backoffMs = false ? options.backoffMs : 500;
     this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
   }

[Timeout] EqualityOperator
src/services/resilience/RetryPolicy.js:4:22
 class RetryPolicy {
   constructor(options = {}) {
     this.maxAttempts = options.maxAttempts !== undefined ? options.maxAttempts : 4; // 1 initial + 3 retries
-    this.backoffMs = options.backoffMs !== undefined ? options.backoffMs : 500;
+    this.backoffMs = options.backoffMs === undefined ? options.backoffMs : 500;
     this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
   }

[Survived] ConditionalExpression
src/services/resilience/RetryPolicy.js:5:22
   constructor(options = {}) {
     this.maxAttempts = options.maxAttempts !== undefined ? options.maxAttempts : 4; // 1 initial + 3 retries
     this.backoffMs = options.backoffMs !== undefined ? options.backoffMs : 500;
-    this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
+    this.timeoutMs = true ? options.timeoutMs : 2000;
   }
 

[Survived] EqualityOperator
src/services/resilience/RetryPolicy.js:5:22
   constructor(options = {}) {
     this.maxAttempts = options.maxAttempts !== undefined ? options.maxAttempts : 4; // 1 initial + 3 retries
     this.backoffMs = options.backoffMs !== undefined ? options.backoffMs : 500;
-    this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
+    this.timeoutMs = options.timeoutMs === undefined ? options.timeoutMs : 2000;
   }
 

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:8:25
     this.timeoutMs = options.timeoutMs !== undefined ? options.timeoutMs : 2000;
   }
 
-  async execute(action) {
-    let lastError;
-    for (let attempt = 1; attempt <= this.maxAttempts; attempt++) {
-      try {
-        return await this.executeWithTimeout(action);
-      } catch (error) {
-        lastError = error;
-        if (attempt < this.maxAttempts) {
-          await new Promise(resolve => setTimeout(resolve, this.backoffMs));
-        }
-      }
-    }
-    throw lastError;
-  }
+  async execute(action) {}
 
   async executeWithTimeout(action) {
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] EqualityOperator
src/services/resilience/RetryPolicy.js:10:27
 
   async execute(action) {
     let lastError;
-    for (let attempt = 1; attempt <= this.maxAttempts; attempt++) {
+    for (let attempt = 1; attempt < this.maxAttempts; attempt++) {
       try {
         return await this.executeWithTimeout(action);
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy reexecuta até obter sucesso antes do limite máximo
statusReason: Error: Falha transitória

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:10:67
 
   async execute(action) {
     let lastError;
-    for (let attempt = 1; attempt <= this.maxAttempts; attempt++) {
-      try {
-        return await this.executeWithTimeout(action);
-      } catch (error) {
-        lastError = error;
-        if (attempt < this.maxAttempts) {
-          await new Promise(resolve => setTimeout(resolve, this.backoffMs));
-        }
-      }
-    }
+    for (let attempt = 1; attempt <= this.maxAttempts; attempt++) {}
     throw lastError;
   }
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy reexecuta até obter sucesso antes do limite máximo
statusReason: Error: thrown: undefined

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:11:11
   async execute(action) {
     let lastError;
     for (let attempt = 1; attempt <= this.maxAttempts; attempt++) {
-      try {
-        return await this.executeWithTimeout(action);
-      } catch (error) {
+      try {} catch (error) {
         lastError = error;
         if (attempt < this.maxAttempts) {
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:13:23
     for (let attempt = 1; attempt <= this.maxAttempts; attempt++) {
       try {
         return await this.executeWithTimeout(action);
-      } catch (error) {
-        lastError = error;
-        if (attempt < this.maxAttempts) {
-          await new Promise(resolve => setTimeout(resolve, this.backoffMs));
-        }
-      }
+      } catch (error) {}
     }
     throw lastError;
killedBy: CheckoutService BDD Specifications Falha de Infraestrutura Persistente com Retentativas Esgotadas (Fallback)
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Survived] EqualityOperator
src/services/resilience/RetryPolicy.js:15:13
         return await this.executeWithTimeout(action);
       } catch (error) {
         lastError = error;
-        if (attempt < this.maxAttempts) {
+        if (attempt <= this.maxAttempts) {
           await new Promise(resolve => setTimeout(resolve, this.backoffMs));
         }

[Survived] ConditionalExpression
src/services/resilience/RetryPolicy.js:15:13
         return await this.executeWithTimeout(action);
       } catch (error) {
         lastError = error;
-        if (attempt < this.maxAttempts) {
+        if (false) {
           await new Promise(resolve => setTimeout(resolve, this.backoffMs));
         }

[Timeout] ArrowFunction
src/services/resilience/RetryPolicy.js:16:29
       } catch (error) {
         lastError = error;
         if (attempt < this.maxAttempts) {
-          await new Promise(resolve => setTimeout(resolve, this.backoffMs));
+          await new Promise(() => undefined);
         }
       }

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:23:36
     throw lastError;
   }
 
-  async executeWithTimeout(action) {
-    let timeoutId;
-    const timeoutPromise = new Promise((_, reject) => {
-      timeoutId = setTimeout(() => {
-        reject(new Error("Timeout operacional do gateway"));
-      }, this.timeoutMs);
-    });
-
-    try {
-      const result = await Promise.race([
-        action(),
-        timeoutPromise
-      ]);
-      return result;
-    } finally {
-      clearTimeout(timeoutId);
-    }
-  }
+  async executeWithTimeout(action) {}
 }
 
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy reexecuta até obter sucesso antes do limite máximo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ok"
Received: undefined

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:25:55
 
   async executeWithTimeout(action) {
     let timeoutId;
-    const timeoutPromise = new Promise((_, reject) => {
-      timeoutId = setTimeout(() => {
-        reject(new Error("Timeout operacional do gateway"));
-      }, this.timeoutMs);
-    });
+    const timeoutPromise = new Promise((_, reject) => {});
 
     try {
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy falha quando o timeout operacional é excedido
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:26:36
   async executeWithTimeout(action) {
     let timeoutId;
     const timeoutPromise = new Promise((_, reject) => {
-      timeoutId = setTimeout(() => {
-        reject(new Error("Timeout operacional do gateway"));
-      }, this.timeoutMs);
+      timeoutId = setTimeout(() => {}, this.timeoutMs);
     });
 
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy falha quando o timeout operacional é excedido
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/services/resilience/RetryPolicy.js:31:9
       }, this.timeoutMs);
     });
 
-    try {
-      const result = await Promise.race([
-        action(),
-        timeoutPromise
-      ]);
-      return result;
-    } finally {
+    try {} finally {
       clearTimeout(timeoutId);
     }
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy reexecuta até obter sucesso antes do limite máximo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ok"
Received: undefined

[Survived] BlockStatement
src/services/resilience/RetryPolicy.js:37:15
         timeoutPromise
       ]);
       return result;
-    } finally {
-      clearTimeout(timeoutId);
-    }
+    } finally {}
   }
 }

[Killed] ObjectLiteral
src/services/resilience/RetryPolicy.js:43:18
   }
 }
 
-module.exports = { RetryPolicy };
+module.exports = {};
 
killedBy: Fase 3 - Mutation Testing Focused Specs RetryPolicy reexecuta até obter sucesso antes do limite máximo
statusReason: TypeError: RetryPolicy is not a constructor
