[Killed] BooleanLiteral
src/services/validation/CheckoutValidator.js:3:9
 class CheckoutValidator {
   static validar(pedido) {
-    if (!pedido) {
+    if (pedido) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] ConditionalExpression
src/services/validation/CheckoutValidator.js:3:9
 class CheckoutValidator {
   static validar(pedido) {
-    if (!pedido) {
+    if (false) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: Fase 3 - Mutation Testing Focused Specs CheckoutValidator rejeita pedido ausente
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Dados incompletos para checkout"
Received message:   "Cannot destructure property 'clienteEmail' of 'pedido' as it is null."

      61 |       }
      62 |       const {
    > 63 |         clienteEmail,

[Killed] BooleanLiteral
src/services/validation/CheckoutValidator.js:10:9
     const { clienteEmail, valor, cartao } = pedido;
 
     // Validate email
-    if (!clienteEmail || typeof clienteEmail !== 'string') {
+    if (clienteEmail || typeof clienteEmail !== 'string') {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] ConditionalExpression
src/services/validation/CheckoutValidator.js:10:9
     const { clienteEmail, valor, cartao } = pedido;
 
     // Validate email
-    if (!clienteEmail || typeof clienteEmail !== 'string') {
+    if (true) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] Regex
src/services/validation/CheckoutValidator.js:13:24
     if (!clienteEmail || typeof clienteEmail !== 'string') {
       throw new Error("Dados incompletos para checkout");
     }
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
     if (!emailRegex.test(clienteEmail)) {
       throw new Error("Dados incompletos para checkout");
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] Regex
src/services/validation/CheckoutValidator.js:13:24
     if (!clienteEmail || typeof clienteEmail !== 'string') {
       throw new Error("Dados incompletos para checkout");
     }
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\S@]+$/;
     if (!emailRegex.test(clienteEmail)) {
       throw new Error("Dados incompletos para checkout");
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] ConditionalExpression
src/services/validation/CheckoutValidator.js:14:9
       throw new Error("Dados incompletos para checkout");
     }
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!emailRegex.test(clienteEmail)) {
+    if (false) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: Fase 3 - Mutation Testing Focused Specs CheckoutValidator rejeita email inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Dados incompletos para checkout"

Received function did not throw

[Killed] ConditionalExpression
src/services/validation/CheckoutValidator.js:14:9
       throw new Error("Dados incompletos para checkout");
     }
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!emailRegex.test(clienteEmail)) {
+    if (true) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] EqualityOperator
src/services/validation/CheckoutValidator.js:19:38
     }
 
     // Validate valor
-    if (typeof valor !== 'number' || valor <= 0) {
+    if (typeof valor !== 'number' || valor < 0) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Validação de Entrada de Dados - Payload Incompleto ou Inválido
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"cartao": {"cvv": "123", "numero": "1234-5678-9012-3456", "validade": "12/28"}, "clienteEmail": "cliente@entregasja.com.br", "id": 9816, "status": "PROCESSADO", "valor": 0}

[Killed] LogicalOperator
src/services/validation/CheckoutValidator.js:19:9
     }
 
     // Validate valor
-    if (typeof valor !== 'number' || valor <= 0) {
+    if (typeof valor !== 'number' && valor <= 0) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Validação de Entrada de Dados - Payload Incompleto ou Inválido
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"cartao": {"cvv": "123", "numero": "1234-5678-9012-3456", "validade": "12/28"}, "clienteEmail": "cliente@entregasja.com.br", "id": 9291, "status": "PROCESSADO", "valor": 0}

[Killed] ConditionalExpression
src/services/validation/CheckoutValidator.js:24:9
     }
 
     // Validate cartao
-    if (!cartao || typeof cartao !== 'object') {
+    if (true) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] BlockStatement
src/services/validation/CheckoutValidator.js:24:48
     }
 
     // Validate cartao
-    if (!cartao || typeof cartao !== 'object') {
-      throw new Error("Dados incompletos para checkout");
-    }
+    if (!cartao || typeof cartao !== 'object') {}
     const { numero, validade, cvv } = cartao;
     if (!numero || !validade || !cvv) {
killedBy: CheckoutService BDD Specifications Validação de Entrada de Dados - Payload Incompleto ou Inválido
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Dados incompletos para checkout"
Received message:   "Cannot destructure property 'numero' of 'cartao' as it is undefined."

      105 |       }
      106 |       const {
    > 107 |         numero,

[Killed] BooleanLiteral
src/services/validation/CheckoutValidator.js:28:20
       throw new Error("Dados incompletos para checkout");
     }
     const { numero, validade, cvv } = cartao;
-    if (!numero || !validade || !cvv) {
+    if (!numero || validade || !cvv) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout

[Killed] BooleanLiteral
src/services/validation/CheckoutValidator.js:28:33
       throw new Error("Dados incompletos para checkout");
     }
     const { numero, validade, cvv } = cartao;
-    if (!numero || !validade || !cvv) {
+    if (!numero || !validade || cvv) {
       throw new Error("Dados incompletos para checkout");
     }
killedBy: CheckoutService BDD Specifications Processamento de Pagamento Autorizado (Caminho Feliz)
statusReason: Error: Dados incompletos para checkout
