[Killed] ConditionalExpression
src/services/resilience/CircuitBreaker.js:19:9
   }
 
   checkCooldown() {
-    if (this.state === 'OPEN' && Date.now() >= this.nextAllowedTime) {
+    if (true) {
       this.state = 'HALF_OPEN';
     }
killedBy: CheckoutService BDD Specifications Circuit Breaker Aberto devido a Alta Taxa de Falhas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4
